wzqvip/esp32-s3-geek-debug-console-tool/sdkconfig.defaults
# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash Size 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM Configuration (ESP32-S3R2 has 2MB Quad PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y

# FreeRTOS 1000Hz tick rate for precise key debouncing and timing
CONFIG_FREERTOS_HZ=1000

# TinyUSB support configuration
CONFIG_TINYUSB=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_NET_MODE_NCM=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y
